clc,clear
a=[59.7	63.2	57.1	58.6	61.4	64.8
67.2	68.4	63.2	61.5	64.7	66.5
74.1	75.5	70.3	72.6	73.4	76.9];
sc1=[5:-2:1,zeros(1,3)]; %1-6名的得分
sc2=repmat(sc1,3,1);
for i=1:3
    for j=1:3
        b=a;
        b(i,3)=1000;b(j,4)=1000; %不参加比赛，时间成绩取为充分大 
        [b,ind]=sort(b,2); %对b的每一行进行排序
        for k=1:3
            sc2(k,ind(k,:))=sc1; %计算各个局势下的3个项目得分
        end
        A (i,j)=sum(sum(sc2(:,[1:3])));  %计算各个局势的得分
        B (i,j)=sum(sum(sc2(:,[4:end])));%计算各个局势的得分
    end   
end
A,B
save AB A B %把A和B保存在AB.mat文件中
